# Configuration d'OSPFv2 (D√©claration par Interfaces)

Ce guide vous explique comment configurer **OSPFv2** sur des routeurs en utilisant une **d√©claration par interfaces**.
OSPFv2 est la version d‚ÄôOSPF con√ßue pour fonctionner avec **IPv4**.

---

## üìã Pr√©requis

* Deux routeurs (ou plus) compatibles OSPFv2.
* Une topologie r√©seau connect√©e (par exemple, via des interfaces Ethernet ou s√©rie).
* Acc√®s en ligne de commande (CLI) aux routeurs.
* IPv4 activ√© et configur√© sur les interfaces.

---

## üåê Configuration de Base d'OSPFv2

### 1. Activer OSPFv2 sur le routeur

Pour activer OSPFv2 sur un routeur Cisco, utilisez la commande suivante en mode configuration globale :

```bash
Router> enable
Router# configure terminal
Router(config)# router ospf <ID_Processus>
```

* `<ID_Processus>` : Identifiant du processus OSPFv2 (par exemple, `1`).

---

### 2. D√©clarer les interfaces OSPFv2

Avec la configuration par **interface**, OSPFv2 est activ√© directement sur les interfaces r√©seau.

#### Exemple de configuration :

```bash
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip ospf <ID_Processus> area <ID_Area>
```

* `<ID_Processus>` : Doit correspondre √† l‚ÄôID du processus OSPFv2 activ√© pr√©c√©demment.
* `<ID_Area>` : Identifiant de l‚Äôaire OSPF (par exemple, `0` pour l‚Äôaire principale).

---

### 3. Configuration compl√®te par interface

Voici un exemple complet de configuration pour un routeur avec deux interfaces IPv4 :

```bash
Router> enable
Router# configure terminal

! Activation du processus OSPFv2
Router(config)# router ospf 1

! Configuration de l'interface GigabitEthernet0/0
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# ip ospf 1 area 0
Router(config-if)# no shutdown

! Configuration de l'interface GigabitEthernet0/1
Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip address 192.168.2.1 255.255.255.0
Router(config-if)# ip ospf 1 area 0
Router(config-if)# no shutdown

Router(config)# end
Router# write memory
```

---

## üîß Configuration Avanc√©e

### 1. D√©finir le co√ªt d'une interface

Le co√ªt OSPFv2 peut √™tre d√©fini manuellement pour influencer le choix du chemin utilis√© par le trafic.

```bash
Router(config-if)# ip ospf cost <valeur>
```

* `<valeur>` : Co√ªt de l‚Äôinterface (par exemple, `100`).

---

### 2. Configurer l‚Äôauthentification OSPFv2

OSPFv2 permet une authentification simple bas√©e sur un mot de passe.

#### Exemple de configuration :

```bash
Router(config-if)# ip ospf authentication
Router(config-if)# ip ospf authentication-key <mot_de_passe>
```

* `<mot_de_passe>` : Mot de passe utilis√© pour l‚Äôauthentification OSPF.

---

### 3. Configurer le type de r√©seau OSPFv2

OSPFv2 peut √™tre configur√© pour fonctionner sur diff√©rents types de r√©seau selon la topologie.

```bash
Router(config-if)# ip ospf network <type>
```

* `<type>` : Type de r√©seau (par exemple, `broadcast`, `point-to-point`, etc.).

---

## üîç V√©rification de la Configuration

### 1. V√©rifier les voisins OSPFv2

Pour v√©rifier que les routeurs OSPFv2 ont √©tabli des relations de voisinage :

```bash
Router# show ip ospf neighbor
```

---

### 2. V√©rifier les routes OSPFv2

Pour afficher les routes IPv4 apprises via OSPFv2 :

```bash
Router# show ip route ospf
```

---

### 3. V√©rifier les interfaces OSPFv2

Pour voir les interfaces sur lesquelles OSPFv2 est activ√© :

```bash
Router# show ip ospf interface brief
```

---

## üìå Notes et Bonnes Pratiques

* **ID de routeur** : Chaque routeur doit avoir un ID unique (par d√©faut, la plus haute adresse IPv4 de loopback ou d‚Äôinterface active).
* **Aires OSPF** : Utilisez les aires pour segmenter votre r√©seau et am√©liorer les performances.
* **S√©curit√©** : Activez toujours l‚Äôauthentification OSPF pour s√©curiser les √©changes.
* **Co√ªt des interfaces** : Ajustez le co√ªt pour influencer le chemin emprunt√© par le trafic.
* **Compatibilit√©** : OSPFv2 fonctionne uniquement avec **IPv4**.

---
